{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "cls_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 45], "dtype": "int32", "sparse": false, "ragged": false, "name": "cls_input"}, "inbound_nodes": []}, {"name": "embedding_vocab", "class_name": "Embedding", "config": {"name": "embedding_vocab", "trainable": true, "batch_input_shape": [null, 45], "dtype": "float32", "input_dim": 4445, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 45}, "inbound_nodes": [[["cls_input", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_vocab", 0, 0, {}]]]}, {"name": "bidirectional", "class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "biLSTM", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "arc_vector", "class_name": "Dense", "config": {"name": "arc_vector", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "ner_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 45], "dtype": "int32", "sparse": false, "ragged": false, "name": "ner_input"}, "inbound_nodes": []}, {"name": "mish", "class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["arc_vector", 0, 0, {}]]]}], "input_layers": [["ner_input", 0, 0], ["cls_input", 0, 0]], "output_layers": [["mish", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}