{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "ner_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 45], "dtype": "int32", "sparse": false, "ragged": false, "name": "ner_input"}, "inbound_nodes": []}, {"name": "embedding_vocab", "class_name": "Embedding", "config": {"name": "embedding_vocab", "trainable": true, "batch_input_shape": [null, 45], "dtype": "float32", "input_dim": 156, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 45}, "inbound_nodes": [[["ner_input", 0, 0, {}]], [["cls_input", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_vocab", 0, 0, {}]]]}, {"name": "bidirectional", "class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "biLSTM", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]], [["dropout", 0, 0, {}]], [["layer_normalization", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional", 1, 0, {}]]]}, {"name": "arc_vector", "class_name": "Dense", "config": {"name": "arc_vector", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]], [["flatten_1", 0, 0, {}]]]}, {"name": "cls", "class_name": "ArcFace", "config": {"name": "cls", "trainable": true, "dtype": "float32", "class_num": 7, "margin": 0.2, "scale": 64.0}, "inbound_nodes": [[["arc_vector", 0, 0, {}]], [["arc_vector", 1, 0, {}]]]}, {"name": "lambda", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAAATAAAAc1AAAABkAWQCbABtAX0BAQB8AWoCdANqBGoFagZ8AGQHZASN\nAmQFgwJ9AnQDagd8AmQIgwJ9AnQDagh8AnQDaglkA4gAZgJkBWQGjQKDAn0CfAJTACkJTukAAAAA\nKQHaCG1hdGhfb3Bz6QEAAAApAdoEYXhpc9oFaW50MzIpAdoFZHR5cGXp/////3IHAAAAKQraFXRl\nbnNvcmZsb3cucHl0aG9uLm9wc3ICAAAA2gRjYXN02gJ0ZtoFa2VyYXPaB2JhY2tlbmTaBmFyZ21h\neNoLZXhwYW5kX2RpbXPaCG11bHRpcGx52gRvbmVzKQPaDW5lcl9jbHNfbGF5ZXJyAgAAANoQY2xz\nX2luZGV4X3RlbnNvcikB2gxtYXBwaW5nX3NpemWpAPpMRDovQ29kZS9weXRob25fY29kZS9tdF9t\nb2RlbF9jb2RlL210bmxwX21vZGVsL210bmxwbW9kZWwvdXRpbHMvbW9kZWxfdXRpbC5wedoKZ2V0\nX3RlbnNvcoUAAABzCgAAAAABDAEaAQwDGgE=\n", null, [5]], "function_type": "lambda", "module": "mtnlpmodel.utils.model_util", "output_shape": [null, 5], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["cls", 1, 0, {}]]]}, {"name": "Discriminator", "class_name": "Model", "config": {"name": "Discriminator", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_1"}, "inbound_nodes": []}], "input_layers": [["input_1", 0, 0]], "output_layers": [["input_1", 0, 0]]}, "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"name": "embedding_virtual", "class_name": "VirtualEmbedding", "config": {"name": "embedding_virtual", "trainable": true, "batch_input_shape": [null, 5], "dtype": "float32", "input_dim": 7, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 5, "mask_length": 5}, "inbound_nodes": [[["Discriminator", 1, 0, {}]]]}, {"name": "cls_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 45], "dtype": "int32", "sparse": false, "ragged": false, "name": "cls_input"}, "inbound_nodes": []}, {"name": "concatenate", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["embedding_virtual", 0, 0, {}], ["dropout", 0, 0, {}]]]}, {"name": "layer_normalization", "class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_vocab", 1, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "layer_normalization_1", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["bidirectional", 2, 0, {}]]]}, {"name": "crf", "class_name": "CRF", "config": {"name": "crf", "trainable": true, "dtype": "float32", "units": 13, "use_boundary": true, "use_bias": true, "use_kernel": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "chain_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "boundary_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "linear", "kernel_regularizer": null, "chain_regularizer": null, "boundary_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "chain_constraint": null, "boundary_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer_normalization_1", 0, 0, {}]]]}], "input_layers": [["ner_input", 0, 0], ["cls_input", 0, 0]], "output_layers": [["crf", 0, 0], ["cls", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}